blog/learn-ocaml-light-dark-theme-switcher-gtk.tutorial.org
#+TITLE: Let's code a GTK Theme Switcher for XFCE in OCaml
#+DATE: <2022-01-28 Fri>
#+SUBTITLE: Code Walktrough – 1st Episode
#+LANGUAGE: en
#+DESCRIPTION: Writing a GTK Theme Switcher for XFCE4 to toggle light/dark mode via shortcut
#+KEYWORDS: ocaml, dark mode, gtk, xfce, gtk theme, linux, tutorial, project idea, learn ocaml
#+HTML_HEAD_EXTRA: <link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/learn-ocaml-light-dark-theme-switcher-gtk.tutorial.html">
#+SETUPFILE: ../static/setup.org
#+PROPERTY: header-args+ :eval no-export
#+OPTIONS:

#+ATTR_HTML: :class pager
#+begin_nav
This post is part of a miniseries:
1. *[[file:learn-ocaml-light-dark-theme-switcher-gtk.tutorial.org][Let's Code a GTK Theme Switcher for XFCE in OCaml]]*
2. [[file:learn-ocaml-config-file-parsing-switch-gtk-theme.walktrough.org][Config File Parsing in OCaml]]
#+end_nav

#+TOC: headlines 2

* Toggle light/dark Mode in XFCE (and Gnome)

I'm using XFCE4 since a couple of years and despite newer desktop environments for Linux, I always went back to XFCE beause it's the least invasive and lets me do the things I want. Changing the XFWM window manager for XMonad or even EXWM? No problem.

But XFCE lacks an easy way to quickly switch from a light theme to a dark mode and back via key shortcut.

Normally, someone would come up with a shell script to do things like that, but I'm about to learn OCaml anyway, so let's write that in OCaml.

* Gathering Information

One can select a GTK theme in XFCE with =xfce4-appearance-settings=. XFCE remembers what theme I've set, so my first guess is that we'll have to find out how and where XFCE does this – in order to change it.

Linux is quite simple as most user preferences are stored in "config files", which are just plain text files located somewhere in =~/.config=. So we can probably do something like this:

1. Find the config file where the information about the selected theme is stored
2. Change the information about the dark/light mode there
3. Tell XFCE to reload the config file in order apply the change immediately

Not so bad for a first guess, but the glorious [[https://wiki.archlinux.org/title/Dark_mode_switching#GTK][ArchLinux wiki has a better idea]] about setting light or dark mode for GTK apps:

#+begin_quote
To change the light/dark mode, you have to change the used theme. Most themes do have a dark variant and those have by convention the suffix -dark. For example the default GTK theme Adwaita has the variant Adwaita-dark.
#+end_quote

Further, the wiki tells us:

#+begin_quote
To switch themes instantly for running programs, either a daemon providing the xsettings spec or gsettings is required. For desktops running with Xorg, an xsettings daemon is needed. For desktops running with Wayland, gsettings is queried.
#+end_quote

Mmmmkay, so the functionality already exists in XFCE4. And it's not about a config file to change, but speaking to daemons. You can issue those commands just straight from the command line (try it!):

** Shell Commands to set dark/light Mode

Under XFCE, you have to use the [[https://docs.xfce.org/xfce/xfconf/xfconf-query][=xfconf-query=]] utility to get/set themes
--> We call this from now on *xsettings* backend

#+caption: Get the name of the currently active themes
#+begin_src shell
  xfconf-query -c xsettings -p /Net/ThemeName
  xfconf-query -c xsettings -p /Net/IconThemeName
#+end_src

#+caption: Set the dark UI theme and a dark icon theme
#+begin_src shell
  xfconf-query -c xsettings -p /Net/ThemeName -s "Adwaita-dark" &&
  xfconf-query -c xsettings -p /Net/IconThemeName -s "Papirus-Dark"
#+end_src

#+caption: Set the light UI theme and a light icon theme
#+begin_src shell
  xfconf-query -c xsettings -p /Net/ThemeName -s "Adwaita" &&
  xfconf-query -c xsettings -p /Net/IconThemeName -s "Papirus-Light"
#+end_src

And in GNOME there is the [[https://wiki.gnome.org/HowDoI/GSettings][=gsettings=]] utility (which you also have to use if you are running Wayland rather than Xorg)
--> We refer to this as the *gsettings* backend.

#+caption: Get the name of the currently active themes
#+begin_src shell
  gsettings get org.gnome.desktop.interface gtk-theme
  gsettings get org.gnome.desktop.interface icon-theme
#+end_src

#+caption: Set the dark UI theme and a dark icon theme
#+begin_src shell
  gsettings set org.gnome.desktop.interface gtk-theme "Adwaita-dark" &&
  gsettings set org.gnome.desktop.interface icon-theme "Papirus-Dark"
#+end_src

#+caption: Set the light UI theme and a light icon theme
#+begin_src shell
  gsettings set org.gnome.desktop.interface gtk-theme "Adwaita" &&
  gsettings set org.gnome.desktop.interface icon-theme "Papirus-Light"
#+end_src

*If you just landed here because you searched for how to set dark/light themes via commmand line or shortcut:*
The easiest solution for you is to define two /application shortcuts/ via =xfce4-keyboard-settings=: the first shortcut to execute the commands to set your dark theme, and the second for your light theme – and you are done. Just copy & paste the set commands above, either the =xsettings= variant or the =gsettings= variant.

*To all others: We're doing real programming here!*
For the sake of learning, we'll just accept the little overhead. So this is going to be a wrapper utilizing the =xsettings= and =gsettings= backends to toggle between light and dark mode with one single shortcut, plus some other features.

