blog/learn-ocaml-light-dark-theme-switcher-gtk.tutorial.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-12-03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Let's code a GTK Theme Switcher for XFCE in OCaml</title>
<meta name="author" content="Dan Dee" />
<meta name="description" content="Writing a GTK Theme Switcher for XFCE4 to toggle light/dark mode via shortcut" />
<meta name="keywords" content="ocaml, dark mode, gtk, xfce, gtk theme, linux, tutorial, project idea, learn ocaml" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Security-Policy" content="default-src 'self'; script-src 'self' https://wa.skred.net/; connect-src https://wa.skred.net/; style-src 'self' https://*; font-src 'self' https://*; img-src 'self' https://*; media-src 'self' https://*;">
<link rel="stylesheet" href="/static/normalize.css" type="text/css">
<link rel="stylesheet" href="/static/org.css" type="text/css">
<link rel="stylesheet" href="/static/style.css" type="text/css">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Cormorant:wght@300&family=Gentium+Plus:ital,wght@0,400;0,700;1,400;1,700&family=PT+Sans+Caption:wght@400;700&family=PT+Sans+Narrow:wght@400;700&family=PT+Sans:ital,wght@0,400;0,700;1,400;1,700&display=swap" rel="stylesheet">
<link rel="stylesheet" href="/static/fonts/iosevka/fonts.css" type="text/css">
<link rel="icon" type="image/svg+xml" href="/static/monkeyjunglejuice.svg">
<link rel="apple-touch-icon" href="/static/monkeyjunglejuice-icon180.png">
<link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/learn-ocaml-light-dark-theme-switcher-gtk.tutorial.html">
</head>
<body>
<div id="preamble" class="status">
<nav id="nav-primary"><a id="site-name" href="/index.html">MonkeyJungleJuice</a> <a id="index" href="/index.html">Index</a><a id="bio" href="/bio.html">Bio</a><a id="github" href="https://github.com/monkeyjunglejuice">Github</a></nav>
<div class="info"><time itemprop="dateModified" datetime="2025-03-24">Last updated: 2025-03-24</time></div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Let&rsquo;s code a GTK Theme Switcher for XFCE in OCaml</h1>
<p class="subtitle" role="doc-subtitle">Code Walktrough – 1st Episode</p>
</header><nav class="pager" id="orgb320189">
<p>
This post is part of a miniseries:<br>
</p>
<ol class="org-ol">
<li><b><a href="learn-ocaml-light-dark-theme-switcher-gtk.tutorial.html">Let&rsquo;s Code a GTK Theme Switcher for XFCE in OCaml</a></b><br></li>
<li><a href="learn-ocaml-config-file-parsing-switch-gtk-theme.walktrough.html">Config File Parsing in OCaml</a><br></li>
</ol>
</nav>

<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9968f4f">Toggle light/dark Mode in XFCE (and Gnome)</a></li>
<li><a href="#org3a56921">Gathering Information</a>
<ul>
<li><a href="#orgc85916d">Shell Commands to set dark/light Mode</a></li>
</ul>
</li>
<li><a href="#org7bfd457">Prerequisites</a></li>
<li><a href="#org65e430d">Features</a></li>
<li><a href="#orgdac8a4e">Where to begin?</a></li>
<li><a href="#orge511321">The »Get« Function</a>
<ul>
<li><a href="#org32bd0fd">Modeling Data Types</a></li>
<li><a href="#org70efd48">Testing the Function in the Toplevel (REPL)</a></li>
<li><a href="#orgaf23085">Remove superfluos Quotes from a String</a></li>
<li><a href="#orgdee51be">Putting the Function together</a></li>
</ul>
</li>
<li><a href="#orgf8e588e">The »Set« Function</a></li>
<li><a href="#org1141251">The »Toggle« Function</a></li>
<li><a href="#orgd0aa8b6">Paaartey! A working Prototype!</a></li>
</ul>
</div>
</nav>
<div id="outline-container-org9968f4f" class="outline-2">
<h2 id="org9968f4f"><a href="#org9968f4f">Toggle light/dark Mode in XFCE (and Gnome)</a></h2>
<div class="outline-text-2" id="text-org9968f4f">
<p>
I&rsquo;m using XFCE4 since a couple of years and despite newer desktop environments for Linux, I always went back to XFCE beause it&rsquo;s the least invasive and lets me do the things I want. Changing the XFWM window manager for XMonad or even EXWM? No problem.<br>
</p>

<p>
But XFCE lacks an easy way to quickly switch from a light theme to a dark mode and back via key shortcut.<br>
</p>

<p>
Normally, someone would come up with a shell script to do things like that, but I&rsquo;m about to learn OCaml anyway, so let&rsquo;s write that in OCaml.<br>
</p>
</div>
</div>
<div id="outline-container-org3a56921" class="outline-2">
<h2 id="org3a56921"><a href="#org3a56921">Gathering Information</a></h2>
<div class="outline-text-2" id="text-org3a56921">
<p>
One can select a GTK theme in XFCE with <code>xfce4-appearance-settings</code>. XFCE remembers what theme I&rsquo;ve set, so my first guess is that we&rsquo;ll have to find out how and where XFCE does this – in order to change it.<br>
</p>

<p>
Linux is quite simple as most user preferences are stored in &ldquo;config files&rdquo;, which are just plain text files located somewhere in <code>~/.config</code>. So we can probably do something like this:<br>
</p>

<ol class="org-ol">
<li>Find the config file where the information about the selected theme is stored<br></li>
<li>Change the information about the dark/light mode there<br></li>
<li>Tell XFCE to reload the config file in order apply the change immediately<br></li>
</ol>

<p>
Not so bad for a first guess, but the glorious <a href="https://wiki.archlinux.org/title/Dark_mode_switching#GTK">ArchLinux wiki has a better idea</a> about setting light or dark mode for GTK apps:<br>
</p>

<blockquote>
<p>
To change the light/dark mode, you have to change the used theme. Most themes do have a dark variant and those have by convention the suffix -dark. For example the default GTK theme Adwaita has the variant Adwaita-dark.<br>
</p>
</blockquote>

<p>
Further, the wiki tells us:<br>
</p>

<blockquote>
<p>
To switch themes instantly for running programs, either a daemon providing the xsettings spec or gsettings is required. For desktops running with Xorg, an xsettings daemon is needed. For desktops running with Wayland, gsettings is queried.<br>
</p>
</blockquote>

<p>
Mmmmkay, so the functionality already exists in XFCE4. And it&rsquo;s not about a config file to change, but speaking to daemons. You can issue those commands just straight from the command line (try it!):<br>
</p>
</div>
<div id="outline-container-orgc85916d" class="outline-3">
<h3 id="orgc85916d"><a href="#orgc85916d">Shell Commands to set dark/light Mode</a></h3>
<div class="outline-text-3" id="text-orgc85916d">
<p>
Under XFCE, you have to use the <a href="https://docs.xfce.org/xfce/xfconf/xfconf-query"><code>xfconf-query</code></a> utility to get/set themes<br>
&#x2013;&gt; We call this from now on <b>xsettings</b> backend<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Get the name of the currently active themes</label><pre class="src src-shell">xfconf-query -c xsettings -p /Net/ThemeName
xfconf-query -c xsettings -p /Net/IconThemeName
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Set the dark UI theme and a dark icon theme</label><pre class="src src-shell">xfconf-query -c xsettings -p /Net/ThemeName -s "Adwaita-dark" &amp;&amp;
xfconf-query -c xsettings -p /Net/IconThemeName -s "Papirus-Dark"
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>Set the light UI theme and a light icon theme</label><pre class="src src-shell">xfconf-query -c xsettings -p /Net/ThemeName -s "Adwaita" &amp;&amp;
xfconf-query -c xsettings -p /Net/IconThemeName -s "Papirus-Light"
</pre>
</div>

<p>
And in GNOME there is the <a href="https://wiki.gnome.org/HowDoI/GSettings"><code>gsettings</code></a> utility (which you also have to use if you are running Wayland rather than Xorg)<br>
&#x2013;&gt; We refer to this as the <b>gsettings</b> backend.<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>Get the name of the currently active themes</label><pre class="src src-shell">gsettings get org.gnome.desktop.interface gtk-theme
gsettings get org.gnome.desktop.interface icon-theme
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>Set the dark UI theme and a dark icon theme</label><pre class="src src-shell">gsettings set org.gnome.desktop.interface gtk-theme "Adwaita-dark" &amp;&amp;
gsettings set org.gnome.desktop.interface icon-theme "Papirus-Dark"
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>Set the light UI theme and a light icon theme</label><pre class="src src-shell">gsettings set org.gnome.desktop.interface gtk-theme "Adwaita" &amp;&amp;
gsettings set org.gnome.desktop.interface icon-theme "Papirus-Light"
</pre>
</div>

<p>
<b>If you just landed here because you searched for how to set dark/light themes via commmand line or shortcut:</b><br>
The easiest solution for you is to define two <i>application shortcuts</i> via <code>xfce4-keyboard-settings</code>: the first shortcut to execute the commands to set your dark theme, and the second for your light theme – and you are done. Just copy &amp; paste the set commands above, either the <code>xsettings</code> variant or the <code>gsettings</code> variant.<br>
</p>

<p>
<b>To all others: We&rsquo;re doing real programming here!</b><br>
For the sake of learning, we&rsquo;ll just accept the little overhead. So this is going to be a wrapper utilizing the <code>xsettings</code> and <code>gsettings</code> backends to toggle between light and dark mode with one single shortcut, plus some other features.<br>
</p>
</div>
</div>
</div>
