blog/learn-ocaml-light-dark-theme-switcher-gtk.tutorial.org
* Prerequisites

If you want to follow the walktrough, you'll need at least:

- *opam* (the OCaml package manager) must be installed and configured
- A computer running either Linux/Unix with XFCE or GNOME Desktop
- A proper editor (e.g. Emacs, Vim or VS Code) with OCaml support
- Very basic programming knowledge (what's a function, variable, etc.)

* Features

What do we need our program to do? Let's make a quick list:

- [ ] Determine the currently active GTK theme
- [ ] Toggle the UI (GTK) theme
- [ ] Change the icon theme accordingly
- [ ] Read the preferences from a config file:
  - [ ] … which backend to use (either xsettings or gsettings)
  - [ ] … or check/select the available backend automatically
  - [ ] … preferred dark/light UI themes
  - [ ] … preferred dark/light icon themes
- [ ] Write the initial config file if it doesn't yet exist
- [ ] Compile a standalone executable

* Where to begin?

/I would like to see the baby!/ Alright, let's implement the core feature first: toggle between the light theme and the dark theme.

When there's only /one/ key combination to switch between light and dark theme, our programm has to make a decision: which theme to set when we press the key. Therefore, at some point our program needs to find out which theme is currently "on". That's a start, eh?

* The »Get« Function

*Getting the name of the currently active theme*

Remember, we can find out what theme is currently active with the shell command we talked about before:

#+caption: Shell command
#+begin_src shell
  xfconf-query -c xsettings -p /Net/ThemeName
#+end_src
#+caption: Output
#+begin_src shell
  Adwaita
#+end_src

We have to execute the shell command from inside our program, and then capture the output of the shell command, so that our program can use this information internally to make a decision. In OCaml, we are doing things with /functions/. We can use the function [[https://www.ocaml.org/api/Unix.html#VALopen_process_in][~Unix.open_process_in~]] from OCaml's /Unix/ module:

#+begin_src ocaml
  Unix.open_process_in "xfconf-query -c xsettings -p /Net/ThemeName"
#+end_src

This function opens an =in_channel=, but doesn't yet spit out the theme name; rather we have to get the theme name from that =in_channel=. We can use another function [[https://www.ocaml.org/api/Stdlib.html#VALinput_line][~input_line~]] that reads from the =in_channel= line by line (Each time [[https://www.ocaml.org/api/Stdlib.html#VALinput_line][~input_line~]] is applied, it returns the next line, until there is none left – but here we call it only once).

#+begin_src ocaml
  input_line (Unix.open_process_in "xfconf-query -c xsettings -p /Net/ThemeName")
#+end_src

Look at the parenthesis: in OCaml we use the parens for grouping, like we do in maths. The parens ensure that the value of the inner function ~(Unix.open_process_in "xfconf-query …")~ is going to be computed first, and the resulting value is passed to the function [[https://www.ocaml.org/api/Stdlib.html#VALinput_line][~input_line~]]. So eventually, the two nested functions above will produce the output we're looking for:

#+begin_src ocaml
  - : string = "Adwaita"
#+end_src

