blog/learn-ocaml-light-dark-theme-switcher-gtk.tutorial.html
<div id="outline-container-org7bfd457" class="outline-2">
<h2 id="org7bfd457"><a href="#org7bfd457">Prerequisites</a></h2>
<div class="outline-text-2" id="text-org7bfd457">
<p>
If you want to follow the walktrough, you&rsquo;ll need at least:<br>
</p>

<ul class="org-ul">
<li><b>opam</b> (the OCaml package manager) must be installed and configured<br></li>
<li>A computer running either Linux/Unix with XFCE or GNOME Desktop<br></li>
<li>A proper editor (e.g. Emacs, Vim or VS Code) with OCaml support<br></li>
<li>Very basic programming knowledge (what&rsquo;s a function, variable, etc.)<br></li>
</ul>
</div>
</div>
<div id="outline-container-org65e430d" class="outline-2">
<h2 id="org65e430d"><a href="#org65e430d">Features</a></h2>
<div class="outline-text-2" id="text-org65e430d">
<p>
What do we need our program to do? Let&rsquo;s make a quick list:<br>
</p>

<ul class="org-ul">
<li class="off">&#x2610; Determine the currently active GTK theme<br></li>
<li class="off">&#x2610; Toggle the UI (GTK) theme<br></li>
<li class="off">&#x2610; Change the icon theme accordingly<br></li>
<li class="off">&#x2610; Read the preferences from a config file:<br>
<ul class="org-ul">
<li class="off">&#x2610; … which backend to use (either xsettings or gsettings)<br></li>
<li class="off">&#x2610; … or check/select the available backend automatically<br></li>
<li class="off">&#x2610; … preferred dark/light UI themes<br></li>
<li class="off">&#x2610; … preferred dark/light icon themes<br></li>
</ul></li>
<li class="off">&#x2610; Write the initial config file if it doesn&rsquo;t yet exist<br></li>
<li class="off">&#x2610; Compile a standalone executable<br></li>
</ul>
</div>
</div>
<div id="outline-container-orgdac8a4e" class="outline-2">
<h2 id="orgdac8a4e"><a href="#orgdac8a4e">Where to begin?</a></h2>
<div class="outline-text-2" id="text-orgdac8a4e">
<p>
<i>I would like to see the baby!</i> Alright, let&rsquo;s implement the core feature first: toggle between the light theme and the dark theme.<br>
</p>

<p>
When there&rsquo;s only <i>one</i> key combination to switch between light and dark theme, our programm has to make a decision: which theme to set when we press the key. Therefore, at some point our program needs to find out which theme is currently &ldquo;on&rdquo;. That&rsquo;s a start, eh?<br>
</p>
</div>
</div>
<div id="outline-container-orge511321" class="outline-2">
<h2 id="orge511321"><a href="#orge511321">The »Get« Function</a></h2>
<div class="outline-text-2" id="text-orge511321">
<p>
<b>Getting the name of the currently active theme</b><br>
</p>

<p>
Remember, we can find out what theme is currently active with the shell command we talked about before:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span>Shell command</label><pre class="src src-shell">xfconf-query -c xsettings -p /Net/ThemeName
</pre>
</div>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 8: </span>Output</label><pre class="src src-shell">Adwaita
</pre>
</div>

<p>
We have to execute the shell command from inside our program, and then capture the output of the shell command, so that our program can use this information internally to make a decision. In OCaml, we are doing things with <i>functions</i>. We can use the function <a href="https://www.ocaml.org/api/Unix.html#VALopen_process_in"><code>Unix.open_process_in</code></a> from OCaml&rsquo;s <i>Unix</i> module:<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml">Unix.open_process_in "xfconf-query -c xsettings -p /Net/ThemeName"
</pre>
</div>

<p>
This function opens an <code>in_channel</code>, but doesn&rsquo;t yet spit out the theme name; rather we have to get the theme name from that <code>in_channel</code>. We can use another function <a href="https://www.ocaml.org/api/Stdlib.html#VALinput_line"><code>input_line</code></a> that reads from the <code>in_channel</code> line by line (Each time <a href="https://www.ocaml.org/api/Stdlib.html#VALinput_line"><code>input_line</code></a> is applied, it returns the next line, until there is none left – but here we call it only once).<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml">input_line (Unix.open_process_in "xfconf-query -c xsettings -p /Net/ThemeName")
</pre>
</div>

<p>
Look at the parenthesis: in OCaml we use the parens for grouping, like we do in maths. The parens ensure that the value of the inner function <code>(Unix.open_process_in "xfconf-query …")</code> is going to be computed first, and the resulting value is passed to the function <a href="https://www.ocaml.org/api/Stdlib.html#VALinput_line"><code>input_line</code></a>. So eventually, the two nested functions above will produce the output we&rsquo;re looking for:<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml">- : string = "Adwaita"
</pre>
</div>
</div>
