blog/learn-ocaml-light-dark-theme-switcher-gtk.tutorial.org
** Modeling Data Types

One more thing before we are going to implement the function: Let's write down what types of data we know of. Just because … we can. We could do without, but it may be of use later. So what do we know?

- We know we are going to use a /backend/, of which there are 2 variants: either /xsettings/ or /gsettings/
- We're also going to deal with a variant of /widget/ at a time: either /UI/ themes or /icon/ themes

We can write this in a formal way OCaml understands, and define types with the keyword ~type~, the name of the type (a.k.a. /type constructor/; lowercase), and variants (a.k.a. /data constructors/; capitalised):

#+begin_example
  type type_constructor = Data_construtor_1
                        | Data_constructor_2
                        | Data_constructor_n
#+end_example

Here you go:

#+begin_src ocaml
  type backend = Xsettings | Gsettings
  type widget = Ui | Icon
#+end_src

For now, the variants will serve as arguments to tell our function for which /"type of backend"/ and which /"type of widget"/ we're asking.

So how could we express "Use the /xsettings/ backend to get the name of the /Ui theme/ and return it" in OCaml?

#+begin_src ocaml
  get_theme Xsettings Ui;;
#+end_src

Until now, this does nothing of course. We'll have to give this expression a meaning first – we need to /implement/ the function. Since there are 2 backends (/xsettings/ and /gsettings/) with 2 widgets each (/UI theme/ and /icon theme/), that makes 4 combinations how we can call the function:

#+begin_src ocaml
  get_theme Xsettings Ui;;            (* 1st combination *)
  get_theme Xsettings Icon;;          (* 2nd combination *)
  get_theme Gsettings Ui;;            (* 3rd combination *)
  get_theme Gsettings Icon;;          (* 4th combination *)
#+end_src

Let's write down what should happen in each case: All we have to do now is just a little "if this, than that". In OCaml, we have a sleek way to do such things, namely pattern matching. Here's the pattern matching syntax with 3 branches:

#+begin_example
  match VALUE(S) with
  | PATTERN_1 -> EXPRESSION_1
  | PATTERN_2 -> EXPRESSION_2
  | PATTERN_N -> EXPRESSION_N
#+end_example

When the function receives the arguments, those will be matched against the /pattern before the arrow/. If there is a match, the corresponding /expression after the arrow/ will be triggered, and that's it. If there is no match, it's the turn of the next branch.

In the first branch we can say:

"If the values for ~backend~ and ~widget~ match ~Xsettings~ and ~Ui~ -> return the first line from the =in_channel= opened by the expression ~(Unix.open_process_in ...~ as a /string/, and stop here. If any of them doesn't match, do nothing but continue with the next branch."

… and for all other branches accordingly:

#+begin_src ocaml
  let get_theme backend widget =
    match backend, widget with
    | Xsettings, Ui ->                                    (* 1st branch *)
      input_line
        (Unix.open_process_in
           "xfconf-query -c xsettings -p /Net/ThemeName")
    | Xsettings, Icon ->                                  (* 2nd branch *)
      input_line
        (Unix.open_process_in
           "xfconf-query -c xsettings -p /Net/IconThemeName")
    | Gsettings, Ui ->                                    (* 3rd branch *)
      input_line
        (Unix.open_process_in
           "gsettings get org.gnome.desktop.interface gtk-theme")
    | Gsettings, Icon ->                                  (* 4th branch *)
      input_line
        (Unix.open_process_in
           "gsettings get org.gnome.desktop.interface icon-theme")
#+end_src

If we fail to handle all possible cases (e.g. we forget one branch/combination), the compiler warns us that the pattern matching is not exhaustive and which cases are unhandled and suggests potential solutions.

*But how does the compiler know …?* Because we've said so before:
#+begin_src ocaml
  type backend = Xsettings | Gsettings
  type widget = Ui | Icon
#+end_src

** Testing the Function in the Toplevel (REPL)

Let's see what happens when we call it with various arguments:

/Side note: expressions in the toplevel end always with =;;= – that's how you can spot if an expression is meant to be evaluated in the toplevel./

#+caption: Toplevel input
#+begin_src ocaml
  get_theme Xsettings Ui;;
#+end_src
#+caption: Result
#+begin_src ocaml
  - : string = "Adwaita" (* <-- Looks good … *)
#+end_src

#+caption: Toplevel input
#+begin_src ocaml
  get_theme Xsettings Icon;;
#+end_src
#+caption: Result
#+begin_src ocaml
  - : string = "Papirus-Light" (* <-- Ok! *)
#+end_src

#+caption: Toplevel input
#+begin_src ocaml
  get_theme Gsettings Ui;;
#+end_src
#+caption: Result
#+begin_src ocaml
  - : string = "'Adwaita'" (* <-- Yikes! What? *)
#+end_src

#+caption: Toplevel input
#+begin_src ocaml
  get_theme Gsettings Icon;;
#+end_src
#+caption: Result
#+begin_src ocaml
  - : string = "'Papirus-Light'" (* <-- Nonono! make those quotes go away! *)
#+end_src

Yeah you may have  guessed it – the =gsettings= shell command returns theme names wrapped in additional ='…'= single quotes, while =xfconf-query= does not. Nah, we don't want that. Should we get rid of them? Yeah probably. They suck.

** Remove superfluos Quotes from a String

We could just use a function to remove the first and last character no matter what, right? But it's good practise to /be specific/: We'll need a helper function that takes a string, looks if there are single quotes at the beginning and end, and returns another string with the same content but without the single quotes.

Let's visit https://ocaml.org/api/ and check if the function we need is readily available in the OCaml library. At a glance we'll see there are two modules related to strings: [[https://ocaml.org/api/String.html][String]] and [[https://ocaml.org/api/Str.html][Str]]. There are in fact several functions we could use to achive the desired result.

