blog/learn-ocaml-light-dark-theme-switcher-gtk.tutorial.html
<div id="outline-container-org32bd0fd" class="outline-3">
<h3 id="org32bd0fd"><a href="#org32bd0fd">Modeling Data Types</a></h3>
<div class="outline-text-3" id="text-org32bd0fd">
<p>
One more thing before we are going to implement the function: Let&rsquo;s write down what types of data we know of. Just because … we can. We could do without, but it may be of use later. So what do we know?<br>
</p>

<ul class="org-ul">
<li>We know we are going to use a <i>backend</i>, of which there are 2 variants: either <i>xsettings</i> or <i>gsettings</i><br></li>
<li>We&rsquo;re also going to deal with a variant of <i>widget</i> at a time: either <i>UI</i> themes or <i>icon</i> themes<br></li>
</ul>

<p>
We can write this in a formal way OCaml understands, and define types with the keyword <code>type</code>, the name of the type (a.k.a. <i>type constructor</i>; lowercase), and variants (a.k.a. <i>data constructors</i>; capitalised):<br>
</p>

<pre class="example" id="org4a8b38d">
type type_constructor = Data_construtor_1
                      | Data_constructor_2
                      | Data_constructor_n
</pre>

<p>
Here you go:<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml">type backend = Xsettings | Gsettings
type widget = Ui | Icon
</pre>
</div>

<p>
For now, the variants will serve as arguments to tell our function for which <i>&ldquo;type of backend&rdquo;</i> and which <i>&ldquo;type of widget&rdquo;</i> we&rsquo;re asking.<br>
</p>

<p>
So how could we express &ldquo;Use the <i>xsettings</i> backend to get the name of the <i>Ui theme</i> and return it&rdquo; in OCaml?<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml">get_theme Xsettings Ui;;
</pre>
</div>

<p>
Until now, this does nothing of course. We&rsquo;ll have to give this expression a meaning first – we need to <i>implement</i> the function. Since there are 2 backends (<i>xsettings</i> and <i>gsettings</i>) with 2 widgets each (<i>UI theme</i> and <i>icon theme</i>), that makes 4 combinations how we can call the function:<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml">get_theme Xsettings Ui;;            (* 1st combination *)
get_theme Xsettings Icon;;          (* 2nd combination *)
get_theme Gsettings Ui;;            (* 3rd combination *)
get_theme Gsettings Icon;;          (* 4th combination *)
</pre>
</div>

<p>
Let&rsquo;s write down what should happen in each case: All we have to do now is just a little &ldquo;if this, than that&rdquo;. In OCaml, we have a sleek way to do such things, namely pattern matching. Here&rsquo;s the pattern matching syntax with 3 branches:<br>
</p>

<pre class="example" id="org549ead3">
match VALUE(S) with
| PATTERN_1 -&gt; EXPRESSION_1
| PATTERN_2 -&gt; EXPRESSION_2
| PATTERN_N -&gt; EXPRESSION_N
</pre>

<p>
When the function receives the arguments, those will be matched against the <i>pattern before the arrow</i>. If there is a match, the corresponding <i>expression after the arrow</i> will be triggered, and that&rsquo;s it. If there is no match, it&rsquo;s the turn of the next branch.<br>
</p>

<p>
In the first branch we can say:<br>
</p>

<p>
&ldquo;If the values for <code>backend</code> and <code>widget</code> match <code>Xsettings</code> and <code>Ui</code> -&gt; return the first line from the <code>in_channel</code> opened by the expression <code>(Unix.open_process_in ...</code> as a <i>string</i>, and stop here. If any of them doesn&rsquo;t match, do nothing but continue with the next branch.&rdquo;<br>
</p>

<p>
… and for all other branches accordingly:<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml">let get_theme backend widget =
  match backend, widget with
  | Xsettings, Ui -&gt;                                    (* 1st branch *)
    input_line
      (Unix.open_process_in
         "xfconf-query -c xsettings -p /Net/ThemeName")
  | Xsettings, Icon -&gt;                                  (* 2nd branch *)
    input_line
      (Unix.open_process_in
         "xfconf-query -c xsettings -p /Net/IconThemeName")
  | Gsettings, Ui -&gt;                                    (* 3rd branch *)
    input_line
      (Unix.open_process_in
         "gsettings get org.gnome.desktop.interface gtk-theme")
  | Gsettings, Icon -&gt;                                  (* 4th branch *)
    input_line
      (Unix.open_process_in
         "gsettings get org.gnome.desktop.interface icon-theme")
</pre>
</div>

<p>
If we fail to handle all possible cases (e.g. we forget one branch/combination), the compiler warns us that the pattern matching is not exhaustive and which cases are unhandled and suggests potential solutions.<br>
</p>

<p>
<b>But how does the compiler know …?</b> Because we&rsquo;ve said so before:<br>
</p>
<div class="org-src-container">
<pre class="src src-ocaml">type backend = Xsettings | Gsettings
type widget = Ui | Icon
</pre>
</div>
</div>
</div>
<div id="outline-container-org70efd48" class="outline-3">
<h3 id="org70efd48"><a href="#org70efd48">Testing the Function in the Toplevel (REPL)</a></h3>
<div class="outline-text-3" id="text-org70efd48">
<p>
Let&rsquo;s see what happens when we call it with various arguments:<br>
</p>

<p>
<i>Side note: expressions in the toplevel end always with <code>;;</code> – that&rsquo;s how you can spot if an expression is meant to be evaluated in the toplevel.</i><br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 9: </span>Toplevel input</label><pre class="src src-ocaml">get_theme Xsettings Ui;;
</pre>
</div>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 10: </span>Result</label><pre class="src src-ocaml">- : string = "Adwaita" (* &lt;-- Looks good … *)
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 11: </span>Toplevel input</label><pre class="src src-ocaml">get_theme Xsettings Icon;;
</pre>
</div>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 12: </span>Result</label><pre class="src src-ocaml">- : string = "Papirus-Light" (* &lt;-- Ok! *)
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 13: </span>Toplevel input</label><pre class="src src-ocaml">get_theme Gsettings Ui;;
</pre>
</div>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 14: </span>Result</label><pre class="src src-ocaml">- : string = "'Adwaita'" (* &lt;-- Yikes! What? *)
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 15: </span>Toplevel input</label><pre class="src src-ocaml">get_theme Gsettings Icon;;
</pre>
</div>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 16: </span>Result</label><pre class="src src-ocaml">- : string = "'Papirus-Light'" (* &lt;-- Nonono! make those quotes go away! *)
</pre>
</div>

<p>
Yeah you may have  guessed it – the <code>gsettings</code> shell command returns theme names wrapped in additional <code>'…'</code> single quotes, while <code>xfconf-query</code> does not. Nah, we don&rsquo;t want that. Should we get rid of them? Yeah probably. They suck.<br>
</p>
</div>
</div>
<div id="outline-container-orgaf23085" class="outline-3">
<h3 id="orgaf23085"><a href="#orgaf23085">Remove superfluos Quotes from a String</a></h3>
<div class="outline-text-3" id="text-orgaf23085">
<p>
We could just use a function to remove the first and last character no matter what, right? But it&rsquo;s good practise to <i>be specific</i>: We&rsquo;ll need a helper function that takes a string, looks if there are single quotes at the beginning and end, and returns another string with the same content but without the single quotes.<br>
</p>

<p>
Let&rsquo;s visit <a href="https://ocaml.org/api/">https://ocaml.org/api/</a> and check if the function we need is readily available in the OCaml library. At a glance we&rsquo;ll see there are two modules related to strings: <a href="https://ocaml.org/api/String.html">String</a> and <a href="https://ocaml.org/api/Str.html">Str</a>. There are in fact several functions we could use to achive the desired result.<br>
</p>
</div>
