blog/learn-ocaml-light-dark-theme-switcher-gtk.tutorial.org
*** Regular Expressions to the Rescue

The [[https://ocaml.org/api/Str.html][~Str~]] module is what we are looking for, and I particularly like the function [[https://www.ocaml.org/api/Str.html#VALglobal_replace][~Str.global_replace~]]:

#+caption: Type signature
#+begin_src ocaml
  val global_replace : regexp -> string -> string -> string
#+end_src

According to the [[https://ocaml.org/api/Str.html#VALglobal_replace][documentation]], the function wants the follwing arguments:
- a regular expression to describe what characters should be replaced
- a template string that says what to put there instead
- and the original string we'd like to liberate from the single quotes

Ok, first we'll need the regex. There it is: ~^'\|'$~ it describes what to pay attention to: a "string beginning with" ~^~ one ~'~ "or" ~|~ one ~'~ "at the end" ~$~.

It took me a while to realize the regular expression we'll going to pass to the function is not just another string, but the function [[https://ocaml.org/api/Str.html#VALregexp][~Str.regexp~]] that takes a string containing the regular expression in order to "compile" it. Yeah that was quite confusing.

- we have the regular expression in parenthesis ~()~
- the template is an empty string ~""~ (because we want to replace the sigle quotes with /nothing/)
- and as the last argument, we'll pass our original string

Now we can test the function in in the toplevel like so:

#+begin_src ocaml
  Str.global_replace (Str.regexp "^'\|'$") "" "'Freemee!'";;
#+end_src

And? Works? Yes, but we're getting a =Warning 14 [illegal-backslash]: illegal backslash escape in string.=

The [[https://ocaml.org/api/Str.html#VALregexp][documentation]] says, that the regex has to be written with double backslashes ~^'\\|'$~, because within strings, the backslash has already a meaning as an escape character, e.g. for ~\n~ (new line) and others. Well well! So here's the final function to "remove" the single quotes:

#+begin_src ocaml
  Str.global_replace (Str.regexp "^'\\|'$") "" "'Freemee!'";;
#+end_src

To make it easier to refer to that function later, let's wrap it in a function and call it ~clean~, so we don't have to type or copypasta the whole thing repeatedly if we're going to use that in more places:

#+begin_src ocaml
  let clean s =
    Str.global_replace (Str.regexp "^'\\|'$") "" s
#+end_src

Now we can do just:
#+begin_src ocaml
  clean "'Adwaita'";;
#+end_src

#+caption: Result
#+begin_src ocaml
  - : string = "Adwaita"
#+end_src

** Putting the Function together

We can make the ~clean~ function available within our ~get_theme~ function via ~let … in~ syntax, and then apply it to the output of the =gsettings= shell commands … but you know what?

What if, say, =xfconf-query= gets an update and suddenly spits out the theme names single-quoted, too? Or does something completly different? I mean, can we /trust/ the output of another program?

Nope, we actually can't. What we can do though, is validating and filtering input – being as specific as possible. So for here, let's apply the ~clean~ function to the results of all 4 branches at least, but leave it at that.

#+begin_src ocaml
  let get_theme backend widget =
    let clean s =        (* we LET the helper function IN here *)
      Str.global_replace (Str.regexp "^'\\|'$") "" s in
    match backend, widget with
    | Xsettings, Ui ->
      clean (input_line  (* <-- we use it in the 1st branch *)
               (Unix.open_process_in
                  "xfconf-query -c xsettings -p /Net/ThemeName"))
    | Xsettings, Icon ->
      clean (input_line  (* <-- and in the 2nd branch *)
               (Unix.open_process_in
                  "xfconf-query -c xsettings -p /Net/IconThemeName"))
    | Gsettings, Ui ->
      clean (input_line  (* <-- in the 3rd branch *)
               (Unix.open_process_in
                  "gsettings get org.gnome.desktop.interface gtk-theme"))
    | Gsettings, Icon ->
      clean (input_line  (* <-- and in the 4th branch, too *)
               (Unix.open_process_in
                  "gsettings get org.gnome.desktop.interface icon-theme"))
#+end_src

Yes, we'll have to group the expression beginning with ~input_line …~ in another set of parens, so that the ~clean~ function will be applied to the /result/ of [[https://www.ocaml.org/api/Stdlib.html#VALinput_line][~input_line~]].

* The »Set« Function

*Setting the GTK- and icon themes*

Once again we're about to wrap shell commands. The ~set_theme~ function is almost the same, so I'll make it short. We're going to use the types again to tell the function which backend to use, and if either the Ui theme or the Icon theme is going to be set. Additionally, we'll pass the theme name to the function as it will become part of the shell commands (via string concatenation through the [[https://www.ocaml.org/api/Stdlib.html#VAL(^)][~^~]] operator).


#+begin_src ocaml
  let set_theme backend widget name =
    match backend, widget with
    | Xsettings, Ui ->
      Unix.open_process
        ("xfconf-query -c xsettings -p /Net/ThemeName -s " ^ name)
    | Xsettings, Icon ->
      Unix.open_process
        ("xfconf-query -c xsettings -p /Net/IconThemeName -s " ^ name)
    | Gsettings, Ui ->
      Unix.open_process
        ("gsettings set org.gnome.desktop.interface gtk-theme " ^ name)
    | Gsettings, Icon ->
      Unix.open_process
        ("gsettings set org.gnome.desktop.interface icon-theme " ^ name)
#+end_src
#+begin_src ocaml
  let _ = set_theme Xsettings Icon "Papirus-Dark" (* apply the function *)
#+end_src

