blog/learn-ocaml-light-dark-theme-switcher-gtk.tutorial.html
<div id="outline-container-orgf6ab125" class="outline-4">
<h4 id="orgf6ab125"><a href="#orgf6ab125">Regular Expressions to the Rescue</a></h4>
<div class="outline-text-4" id="text-orgf6ab125">
<p>
The <a href="https://ocaml.org/api/Str.html"><code>Str</code></a> module is what we are looking for, and I particularly like the function <a href="https://www.ocaml.org/api/Str.html#VALglobal_replace"><code>Str.global_replace</code></a>:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 17: </span>Type signature</label><pre class="src src-ocaml">val global_replace : regexp -&gt; string -&gt; string -&gt; string
</pre>
</div>

<p>
According to the <a href="https://ocaml.org/api/Str.html#VALglobal_replace">documentation</a>, the function wants the follwing arguments:<br>
</p>
<ul class="org-ul">
<li>a regular expression to describe what characters should be replaced<br></li>
<li>a template string that says what to put there instead<br></li>
<li>and the original string we&rsquo;d like to liberate from the single quotes<br></li>
</ul>

<p>
Ok, first we&rsquo;ll need the regex. There it is: <code>^'\|'$</code> it describes what to pay attention to: a &ldquo;string beginning with&rdquo; <code>^</code> one <code>'</code> &ldquo;or&rdquo; <code>|</code> one <code>'</code> &ldquo;at the end&rdquo; <code>$</code>.<br>
</p>

<p>
It took me a while to realize the regular expression we&rsquo;ll going to pass to the function is not just another string, but the function <a href="https://ocaml.org/api/Str.html#VALregexp"><code>Str.regexp</code></a> that takes a string containing the regular expression in order to &ldquo;compile&rdquo; it. Yeah that was quite confusing.<br>
</p>

<ul class="org-ul">
<li>we have the regular expression in parenthesis <code>()</code><br></li>
<li>the template is an empty string <code>""</code> (because we want to replace the sigle quotes with <i>nothing</i>)<br></li>
<li>and as the last argument, we&rsquo;ll pass our original string<br></li>
</ul>

<p>
Now we can test the function in in the toplevel like so:<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml">Str.global_replace (Str.regexp "^'\|'$") "" "'Freemee!'";;
</pre>
</div>

<p>
And? Works? Yes, but we&rsquo;re getting a <code>Warning 14 [illegal-backslash]: illegal backslash escape in string.</code><br>
</p>

<p>
The <a href="https://ocaml.org/api/Str.html#VALregexp">documentation</a> says, that the regex has to be written with double backslashes <code>^'\\|'$</code>, because within strings, the backslash has already a meaning as an escape character, e.g. for <code>\n</code> (new line) and others. Well well! So here&rsquo;s the final function to &ldquo;remove&rdquo; the single quotes:<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml">Str.global_replace (Str.regexp "^'\\|'$") "" "'Freemee!'";;
</pre>
</div>

<p>
To make it easier to refer to that function later, let&rsquo;s wrap it in a function and call it <code>clean</code>, so we don&rsquo;t have to type or copypasta the whole thing repeatedly if we&rsquo;re going to use that in more places:<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml">let clean s =
  Str.global_replace (Str.regexp "^'\\|'$") "" s
</pre>
</div>

<p>
Now we can do just:<br>
</p>
<div class="org-src-container">
<pre class="src src-ocaml">clean "'Adwaita'";;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 18: </span>Result</label><pre class="src src-ocaml">- : string = "Adwaita"
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdee51be" class="outline-3">
<h3 id="orgdee51be"><a href="#orgdee51be">Putting the Function together</a></h3>
<div class="outline-text-3" id="text-orgdee51be">
<p>
We can make the <code>clean</code> function available within our <code>get_theme</code> function via <code>let … in</code> syntax, and then apply it to the output of the <code>gsettings</code> shell commands … but you know what?<br>
</p>

<p>
What if, say, <code>xfconf-query</code> gets an update and suddenly spits out the theme names single-quoted, too? Or does something completly different? I mean, can we <i>trust</i> the output of another program?<br>
</p>

<p>
Nope, we actually can&rsquo;t. What we can do though, is validating and filtering input – being as specific as possible. So for here, let&rsquo;s apply the <code>clean</code> function to the results of all 4 branches at least, but leave it at that.<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml">let get_theme backend widget =
  let clean s =        (* we LET the helper function IN here *)
    Str.global_replace (Str.regexp "^'\\|'$") "" s in
  match backend, widget with
  | Xsettings, Ui -&gt;
    clean (input_line  (* &lt;-- we use it in the 1st branch *)
             (Unix.open_process_in
                "xfconf-query -c xsettings -p /Net/ThemeName"))
  | Xsettings, Icon -&gt;
    clean (input_line  (* &lt;-- and in the 2nd branch *)
             (Unix.open_process_in
                "xfconf-query -c xsettings -p /Net/IconThemeName"))
  | Gsettings, Ui -&gt;
    clean (input_line  (* &lt;-- in the 3rd branch *)
             (Unix.open_process_in
                "gsettings get org.gnome.desktop.interface gtk-theme"))
  | Gsettings, Icon -&gt;
    clean (input_line  (* &lt;-- and in the 4th branch, too *)
             (Unix.open_process_in
                "gsettings get org.gnome.desktop.interface icon-theme"))
</pre>
</div>

<p>
Yes, we&rsquo;ll have to group the expression beginning with <code>input_line …</code> in another set of parens, so that the <code>clean</code> function will be applied to the <i>result</i> of <a href="https://www.ocaml.org/api/Stdlib.html#VALinput_line"><code>input_line</code></a>.<br>
</p>
</div>
</div>
</div>
<div id="outline-container-orgf8e588e" class="outline-2">
<h2 id="orgf8e588e"><a href="#orgf8e588e">The »Set« Function</a></h2>
<div class="outline-text-2" id="text-orgf8e588e">
<p>
<b>Setting the GTK- and icon themes</b><br>
</p>

<p>
Once again we&rsquo;re about to wrap shell commands. The <code>set_theme</code> function is almost the same, so I&rsquo;ll make it short. We&rsquo;re going to use the types again to tell the function which backend to use, and if either the Ui theme or the Icon theme is going to be set. Additionally, we&rsquo;ll pass the theme name to the function as it will become part of the shell commands (via string concatenation through the <a href="https://www.ocaml.org/api/Stdlib.html#VAL(%5E)"><code>^</code></a> operator).<br>
</p>


<div class="org-src-container">
<pre class="src src-ocaml">let set_theme backend widget name =
  match backend, widget with
  | Xsettings, Ui -&gt;
    Unix.open_process
      ("xfconf-query -c xsettings -p /Net/ThemeName -s " ^ name)
  | Xsettings, Icon -&gt;
    Unix.open_process
      ("xfconf-query -c xsettings -p /Net/IconThemeName -s " ^ name)
  | Gsettings, Ui -&gt;
    Unix.open_process
      ("gsettings set org.gnome.desktop.interface gtk-theme " ^ name)
  | Gsettings, Icon -&gt;
    Unix.open_process
      ("gsettings set org.gnome.desktop.interface icon-theme " ^ name)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-ocaml">let _ = set_theme Xsettings Icon "Papirus-Dark" (* apply the function *)
</pre>
</div>
</div>
</div>
