blog/learn-ocaml-light-dark-theme-switcher-gtk.tutorial.org
* The »Toggle« Function

*Making a decision*

Until now, we have built two functions ~get_theme~ and ~set_theme~. Let's use those in our third function and bring the action!

Our toggle function needs to know several preferences to wield its magic. First, we are going to specify the preferences directly within the function with ~let … in~ bindings (for simplicity's sake). Later, when we know the function works, we are going to use a config file.

- Which backend to get/set the themes --> identifier ~backend~
- Name of the currently active UI theme --> identifier ~current_ui~
- Name of the dark UI theme --> identifier ~ui_dark~
- Name of the light UI theme --> identifier ~ui_light~
- Name of the dark icon theme --> identifier ~icon_dark~
- Name of the light icon theme --> identifier ~icon_light~

"Magic" is a bit of an exaggeration – we use simple conditions here. As the themes come in pairs, *the program just needs to set "the other one"*. The decision which theme to set, depends on the /currently active/ UI theme ~current_ui~. So we're going to ~match current_ui with~ pattern(s).

1. For the first branch, we can do:
   "When ~current_ui~ equals the value of ~ui_dark~ -> use the ~backend~ to set the UI theme ~ui_light~; then use the ~backend~ to set the icon theme ~icon_light~".
2. The second branch does the same, but vice-versa.
3. But what should happen if there has been set a different theme, which is none of the preconfigured dark/light theme pair? E.g. set by the XFCE appearance control panel? We can address this by introducing a third branch – the catch-all: Whenever the identifier ~current_ui~ carries an unexpected value, fall back to the preconfigured ~ui_light~ and ~icon_light~.

#+caption: Define the function
#+begin_src ocaml
  let toggle () =
    let backend = Xsettings in
    let current_ui = get_theme backend Ui in (* 2nd argument is the value above *)
    let ui_dark = "Adwaita-dark" in
    let ui_light = "Adwaita" in
    let icon_dark = "Papirus-Dark" in
    let icon_light = "Papirus-Light" in
    match current_ui with
    | c when String.equal c ui_dark ->
      let _ = set_theme backend Ui ui_light in
      set_theme backend Icon icon_light
    | c when String.equal c ui_light ->
      let _ = set_theme backend Ui ui_dark in
      set_theme backend Icon icon_dark
    | _ ->
      let _ = set_theme backend Ui ui_light in
      set_theme backend Icon icon_light
#+end_src
#+caption: Apply the function eventually
#+begin_src ocaml
  let _ = toggle ()
#+end_src

There may arise some questions:
- /What does ~c~ mean in the 1st and 2nd branch?/
  When matching a pattern, we can simultaneously bind one or more identifiers to certain parts of the matched object to use those parts in other places within the same branch. Here, we bind the whole value of ~current_ui~ to ~c~.
- /What does the ~when~ keyword do?/
  ~when~ introduces a /guard/ expression. If the guard expression evaluates to ~true~, then evaluate the expression after the arrow; if false, just continue with the next branch.
- /Why has the expression after the arrow the form ~let _ = <expression1> in <expression2>~?/
  We can use the nested ~let … in~ forms to do more than one thing after the other. And the single underscore (wildcard) means that we don't care to give it a name. It's evaluated only for its /side effects/ (to trigger the shell commands).

* Paaartey! A working Prototype!

Ok ok, relax. We are not there yet. For now it runs in the toplevel, yes. Take a little break and do some Push-ups. Here's the code we cooked up so far:

#+caption: Working prototype
#+begin_src ocaml
  type backend = Xsettings | Gsettings
  type widget = Ui | Icon

  let get_theme backend widget =
    let clean s =
      Str.global_replace (Str.regexp "^'\\|'$") "" s in
    match backend, widget with
    | Xsettings, Ui ->
      clean (input_line
               (Unix.open_process_in
                  "xfconf-query -c xsettings -p /Net/ThemeName"))
    | Xsettings, Icon ->
      clean (input_line
               (Unix.open_process_in
                  "xfconf-query -c xsettings -p /Net/IconThemeName"))
    | Gsettings, Ui ->
      clean (input_line
               (Unix.open_process_in
                  "gsettings get org.gnome.desktop.interface gtk-theme"))
    | Gsettings, Icon ->
      clean (input_line
               (Unix.open_process_in
                  "gsettings get org.gnome.desktop.interface icon-theme"))

  let set_theme backend widget name =
    match backend, widget with
    | Xsettings, Ui ->
      Unix.open_process
        ("xfconf-query -c xsettings -p /Net/ThemeName -s " ^ name)
    | Xsettings, Icon ->
      Unix.open_process
        ("xfconf-query -c xsettings -p /Net/IconThemeName -s " ^ name)
    | Gsettings, Ui ->
      Unix.open_process
        ("gsettings set org.gnome.desktop.interface gtk-theme " ^ name)
    | Gsettings, Icon ->
      Unix.open_process
        ("gsettings set org.gnome.desktop.interface icon-theme " ^ name)

  let toggle () =
    let backend = Xsettings in
    let current_ui = get_theme backend Ui in
    let ui_dark = "Adwaita-dark" in
    let ui_light = "Adwaita" in
    let icon_dark = "Papirus-Dark" in
    let icon_light = "Papirus-Light" in
    match current_ui with
    | c when String.equal c ui_dark ->
      let _ = set_theme backend Ui ui_light in
      set_theme backend Icon icon_light
    | c when String.equal c ui_light ->
      let _ = set_theme backend Ui ui_dark in
      set_theme backend Icon icon_dark
    | _ ->
      let _ = set_theme backend Ui ui_light in
      set_theme backend Icon icon_light

  let _ = toggle ()
#+end_src

[[file:learn-ocaml-config-file-parsing-switch-gtk-theme.walktrough.org][We're going to finish this in the next episode!]]

*Where do we stand now?*
- [X] Determine the currently active GTK theme
- [X] Toggle the UI (GTK) theme
- [X] Change the icon theme accordingly

*What's next?*
- [ ] Read the preferences from a config file:
  - [ ] … preferred dark/light UI themes
  - [ ] … preferred dark/light icon themes
  - [ ] … which backend to use (either xsettings or gsettings)
  - [ ] … or check/select the available backend automatically?
- [ ] Write the initial config file if it doesn't exist yet
- [ ] Compile a standalone executable
