blog/learn-ocaml-light-dark-theme-switcher-gtk.tutorial.html
<div id="outline-container-org1141251" class="outline-2">
<h2 id="org1141251"><a href="#org1141251">The »Toggle« Function</a></h2>
<div class="outline-text-2" id="text-org1141251">
<p>
<b>Making a decision</b><br>
</p>

<p>
Until now, we have built two functions <code>get_theme</code> and <code>set_theme</code>. Let&rsquo;s use those in our third function and bring the action!<br>
</p>

<p>
Our toggle function needs to know several preferences to wield its magic. First, we are going to specify the preferences directly within the function with <code>let … in</code> bindings (for simplicity&rsquo;s sake). Later, when we know the function works, we are going to use a config file.<br>
</p>

<ul class="org-ul">
<li>Which backend to get/set the themes &#x2013;&gt; identifier <code>backend</code><br></li>
<li>Name of the currently active UI theme &#x2013;&gt; identifier <code>current_ui</code><br></li>
<li>Name of the dark UI theme &#x2013;&gt; identifier <code>ui_dark</code><br></li>
<li>Name of the light UI theme &#x2013;&gt; identifier <code>ui_light</code><br></li>
<li>Name of the dark icon theme &#x2013;&gt; identifier <code>icon_dark</code><br></li>
<li>Name of the light icon theme &#x2013;&gt; identifier <code>icon_light</code><br></li>
</ul>

<p>
&ldquo;Magic&rdquo; is a bit of an exaggeration – we use simple conditions here. As the themes come in pairs, <b>the program just needs to set &ldquo;the other one&rdquo;</b>. The decision which theme to set, depends on the <i>currently active</i> UI theme <code>current_ui</code>. So we&rsquo;re going to <code>match current_ui with</code> pattern(s).<br>
</p>

<ol class="org-ol">
<li>For the first branch, we can do:<br>
&ldquo;When <code>current_ui</code> equals the value of <code>ui_dark</code> -&gt; use the <code>backend</code> to set the UI theme <code>ui_light</code>; then use the <code>backend</code> to set the icon theme <code>icon_light</code>&rdquo;.<br></li>
<li>The second branch does the same, but vice-versa.<br></li>
<li>But what should happen if there has been set a different theme, which is none of the preconfigured dark/light theme pair? E.g. set by the XFCE appearance control panel? We can address this by introducing a third branch – the catch-all: Whenever the identifier <code>current_ui</code> carries an unexpected value, fall back to the preconfigured <code>ui_light</code> and <code>icon_light</code>.<br></li>
</ol>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 19: </span>Define the function</label><pre class="src src-ocaml">let toggle () =
  let backend = Xsettings in
  let current_ui = get_theme backend Ui in (* 2nd argument is the value above *)
  let ui_dark = "Adwaita-dark" in
  let ui_light = "Adwaita" in
  let icon_dark = "Papirus-Dark" in
  let icon_light = "Papirus-Light" in
  match current_ui with
  | c when String.equal c ui_dark -&gt;
    let _ = set_theme backend Ui ui_light in
    set_theme backend Icon icon_light
  | c when String.equal c ui_light -&gt;
    let _ = set_theme backend Ui ui_dark in
    set_theme backend Icon icon_dark
  | _ -&gt;
    let _ = set_theme backend Ui ui_light in
    set_theme backend Icon icon_light
</pre>
</div>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 20: </span>Apply the function eventually</label><pre class="src src-ocaml">let _ = toggle ()
</pre>
</div>

<p>
There may arise some questions:<br>
</p>
<ul class="org-ul">
<li><i>What does <code>c</code> mean in the 1st and 2nd branch?</i><br>
When matching a pattern, we can simultaneously bind one or more identifiers to certain parts of the matched object to use those parts in other places within the same branch. Here, we bind the whole value of <code>current_ui</code> to <code>c</code>.<br></li>
<li><i>What does the <code>when</code> keyword do?</i><br>
<code>when</code> introduces a <i>guard</i> expression. If the guard expression evaluates to <code>true</code>, then evaluate the expression after the arrow; if false, just continue with the next branch.<br></li>
<li><i>Why has the expression after the arrow the form <code>let _ = &lt;expression1&gt; in &lt;expression2&gt;</code>?</i><br>
We can use the nested <code>let … in</code> forms to do more than one thing after the other. And the single underscore (wildcard) means that we don&rsquo;t care to give it a name. It&rsquo;s evaluated only for its <i>side effects</i> (to trigger the shell commands).<br></li>
</ul>
</div>
</div>
<div id="outline-container-orgd0aa8b6" class="outline-2">
<h2 id="orgd0aa8b6"><a href="#orgd0aa8b6">Paaartey! A working Prototype!</a></h2>
<div class="outline-text-2" id="text-orgd0aa8b6">
<p>
Ok ok, relax. We are not there yet. For now it runs in the toplevel, yes. Take a little break and do some Push-ups. Here&rsquo;s the code we cooked up so far:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 21: </span>Working prototype</label><pre class="src src-ocaml">type backend = Xsettings | Gsettings
type widget = Ui | Icon

let get_theme backend widget =
  let clean s =
    Str.global_replace (Str.regexp "^'\\|'$") "" s in
  match backend, widget with
  | Xsettings, Ui -&gt;
    clean (input_line
             (Unix.open_process_in
                "xfconf-query -c xsettings -p /Net/ThemeName"))
  | Xsettings, Icon -&gt;
    clean (input_line
             (Unix.open_process_in
                "xfconf-query -c xsettings -p /Net/IconThemeName"))
  | Gsettings, Ui -&gt;
    clean (input_line
             (Unix.open_process_in
                "gsettings get org.gnome.desktop.interface gtk-theme"))
  | Gsettings, Icon -&gt;
    clean (input_line
             (Unix.open_process_in
                "gsettings get org.gnome.desktop.interface icon-theme"))

let set_theme backend widget name =
  match backend, widget with
  | Xsettings, Ui -&gt;
    Unix.open_process
      ("xfconf-query -c xsettings -p /Net/ThemeName -s " ^ name)
  | Xsettings, Icon -&gt;
    Unix.open_process
      ("xfconf-query -c xsettings -p /Net/IconThemeName -s " ^ name)
  | Gsettings, Ui -&gt;
    Unix.open_process
      ("gsettings set org.gnome.desktop.interface gtk-theme " ^ name)
  | Gsettings, Icon -&gt;
    Unix.open_process
      ("gsettings set org.gnome.desktop.interface icon-theme " ^ name)

let toggle () =
  let backend = Xsettings in
  let current_ui = get_theme backend Ui in
  let ui_dark = "Adwaita-dark" in
  let ui_light = "Adwaita" in
  let icon_dark = "Papirus-Dark" in
  let icon_light = "Papirus-Light" in
  match current_ui with
  | c when String.equal c ui_dark -&gt;
    let _ = set_theme backend Ui ui_light in
    set_theme backend Icon icon_light
  | c when String.equal c ui_light -&gt;
    let _ = set_theme backend Ui ui_dark in
    set_theme backend Icon icon_dark
  | _ -&gt;
    let _ = set_theme backend Ui ui_light in
    set_theme backend Icon icon_light

let _ = toggle ()
</pre>
</div>

<p>
<a href="learn-ocaml-config-file-parsing-switch-gtk-theme.walktrough.html">We&rsquo;re going to finish this in the next episode!</a><br>
</p>

<p>
<b>Where do we stand now?</b><br>
</p>
<ul class="org-ul">
<li class="on">&#x2611; Determine the currently active GTK theme<br></li>
<li class="on">&#x2611; Toggle the UI (GTK) theme<br></li>
<li class="on">&#x2611; Change the icon theme accordingly<br></li>
</ul>

<p>
<b>What&rsquo;s next?</b><br>
</p>
<ul class="org-ul">
<li class="off">&#x2610; Read the preferences from a config file:<br>
<ul class="org-ul">
<li class="off">&#x2610; … preferred dark/light UI themes<br></li>
<li class="off">&#x2610; … preferred dark/light icon themes<br></li>
<li class="off">&#x2610; … which backend to use (either xsettings or gsettings)<br></li>
<li class="off">&#x2610; … or check/select the available backend automatically?<br></li>
</ul></li>
<li class="off">&#x2610; Write the initial config file if it doesn&rsquo;t exist yet<br></li>
<li class="off">&#x2610; Compile a standalone executable<br></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">Published by <span class="author"><a href="/bio.html">Dan Dee</a></span></div>
<script defer src="/static/footer.js"></script>
</div>
</body>
</html>
